# Series

In [1]:
import pandas as pd

In [9]:
x = [3,434,53,42]

var = pd.Series(x, index = ['a', 'b' , 'c' , 'd'] , dtype = 'float', name = 'Python')
print(var)
print(type(var))
print(var[2])

a      3.0
b    434.0
c     53.0
d     42.0
Name: Python, dtype: float64
<class 'pandas.core.series.Series'>
53.0

C:\Users\anshu\AppData\Local\Temp\ipykernel_11204\3621566571.py:6: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(var[2])

In [11]:
dictionary = {
    'name' : ['python' , 'java ', 'c' , 'html'],
    'rank' : [1 , 2 , 3 ,4 ],
    'power' : [100 , 200, 100 ,9999]
}

var1 = pd.Series(dictionary)
print(var1)

name     [python, java , c, html]
rank                 [1, 2, 3, 4]
power       [100, 200, 100, 9999]
dtype: object

In [13]:
s = pd.Series(12 , index = [1,2,3,4,5])
print(s)

1    12
2    12
3    12
4    12
5    12
dtype: int64

In [14]:
s1 = pd.Series(12 , index = [1,2,3,4,5,6,7,8,9])
s2 = pd.Series(12 , index = [1,2,3,4,5])
print(s1+s2)

1    24.0
2    24.0
3    24.0
4    24.0
5    24.0
6     NaN
7     NaN
8     NaN
9     NaN
dtype: float64

# DataFrame

In [20]:
import pandas as pd
l = [1,2,3,4,5,6]

var = pd.DataFrame(l)

print(type(var))
print(var)

<class 'pandas.core.frame.DataFrame'>
   0
0  1
1  2
2  3
3  4
4  5
5  6

In [21]:
var = pd.DataFrame({'A': [1,2,3,4,5] , 'B' : [6,7,8,9,10]})

print(var)

   A   B
0  1   6
1  2   7
2  3   8
3  4   9
4  5  10

In [23]:
var['C'] = var['A'] + var['B']

print(var)

   A   B   C
0  1   6   7
1  2   7   9
2  3   8  11
3  4   9  13
4  5  10  15

In [25]:
var['D'] = var['A'] - var['B']

print(var)

   A   B   C  D
0  1   6   7 -5
1  2   7   9 -5
2  3   8  11 -5
3  4   9  13 -5
4  5  10  15 -5

In [32]:
var['E'] = var['A'] / var['B']

print(var)

   A   B   C  D         E   f   F
0  1   6   6 -5  0.166667   6   6
1  2   7  14 -5  0.285714  14  14
2  3   8  24 -5  0.375000  24  24
3  4   9  36 -5  0.444444  36  36
4  5  10  50 -5  0.500000  50  50

In [43]:
var['F'] = var['A'] * var['B']

print(var)

   A  Python   B   F
0  1       1   6   6
1  2       2   7  14
2  3       3   8  24
3  4       4   9  36
4  5       5  10  50

# Insert and Delete??

In [41]:
# var.insert(index,column_name,Data_insert)
var1 = pd.DataFrame({'A': [1,2,3,4,5] , 'B' : [6,7,8,9,10]})

var1.insert(1,"Python",var['A'])

var1

   A  Python   B
0  1       1   6
1  2       2   7
2  3       3   8
3  4       4   9
4  5       5  10

In [44]:
var

   A  Python   B   F
0  1       1   6   6
1  2       2   7  14
2  3       3   8  24
3  4       4   9  36
4  5       5  10  50

In [ ]:
var.pop('F')  #  F delete ho gya

0     6
1    14
2    24
3    36
4    50
Name: F, dtype: int64

In [46]:
var

   A  Python   B
0  1       1   6
1  2       2   7
2  3       3   8
3  4       4   9
4  5       5  10

# Write CSV

In [50]:
dis = {'a': [2,5,2,63,53,754,324,23], 's': [234,43,243,33,33,34,3424,23], 'd': [22,543,23,563,253,754,3224,223]}

d = pd.DataFrame(dis)

print(d)


d.to_csv("test_new.csv" , index = False , header=[1,2,3])

     a     s     d
0    2   234    22
1    5    43   543
2    2   243    23
3   63    33   563
4   53    33   253
5  754    34   754
6  324  3424  3224
7   23    23   223

In [52]:
import pandas as pd
import numpy as np
import random

# Set a seed so the random numbers are the same every time
np.random.seed(42)

num_rows = 1000

data = {
    'Employee_ID': range(1, num_rows + 1),
    'Department': np.random.choice(['HR', 'Engineering', 'Sales', 'Marketing'], num_rows),
    'Age': np.random.randint(22, 60, num_rows),
    'Salary': np.random.randint(40000, 150000, num_rows),
    'Years_Experience': np.random.randint(0, 20, num_rows),
    'Performance_Score': np.random.uniform(1.0, 5.0, num_rows).round(1)
}

df = pd.DataFrame(data)

df.to_csv('large_employee_data.csv', index=False)
print(f"File 'large_employee_data.csv' created with {num_rows} rows.")

File 'large_employee_data.csv' created with 1000 rows.

In [53]:
df.head()

   Employee_ID Department  Age  Salary  Years_Experience  Performance_Score
0            1      Sales   38   77412                 3                3.2
1            2  Marketing   30   42920                 1                4.1
2            3         HR   54  131194                17                1.8
3            4      Sales   41  100315                18                3.9
4            5      Sales   34  119561                18                3.5

In [54]:
df.tail()

     Employee_ID Department  Age  Salary  Years_Experience  Performance_Score
995          996         HR   39   56087                 4                1.8
996          997         HR   27   88868                19                1.0
997          998  Marketing   39   63225                17                1.2
998          999  Marketing   40  135286                10                4.6
999         1000      Sales   43   46643                14                3.6

In [56]:
data = pd.read_csv("large_employee_data.csv")
data

     Employee_ID Department  Age  Salary  Years_Experience  Performance_Score
0              1      Sales   38   77412                 3                3.2
1              2  Marketing   30   42920                 1                4.1
2              3         HR   54  131194                17                1.8
3              4      Sales   41  100315                18                3.9
4              5      Sales   34  119561                18                3.5
..           ...        ...  ...     ...               ...                ...
995          996         HR   39   56087                 4                1.8
996          997         HR   27   88868                19                1.0
997          998  Marketing   39   63225                17                1.2
998          999  Marketing   40  135286                10                4.6
999         1000      Sales   43   46643                14                3.6

[1000 rows x 6 columns]

In [58]:
data = pd.read_csv("large_employee_data.csv" , nrows = 1) # nrows = 1 ,hame first row de raha hai

data

   Employee_ID Department  Age  Salary  Years_Experience  Performance_Score
0            1      Sales   38   77412                 3                3.2

In [ ]:
data = pd.read_csv("large_employee_data.csv" , nrows = 3) # nrows = 3 ,hame first 3 rows de raha hai

data

   Employee_ID Department  Age  Salary  Years_Experience  Performance_Score
0            1      Sales   38   77412                 3                3.2
1            2  Marketing   30   42920                 1                4.1
2            3         HR   54  131194                17                1.8

In [ ]:
data = pd.read_csv("large_employee_data.csv" , usecols=["Department"]) 

data

    Department
0        Sales
1    Marketing
2           HR
3        Sales
4        Sales
..         ...
995         HR
996         HR
997  Marketing
998  Marketing
999      Sales

[1000 rows x 1 columns]

In [61]:
data = pd.read_csv("large_employee_data.csv" , usecols=["Department" , "Salary"]) 

data

    Department  Salary
0        Sales   77412
1    Marketing   42920
2           HR  131194
3        Sales  100315
4        Sales  119561
..         ...     ...
995         HR   56087
996         HR   88868
997  Marketing   63225
998  Marketing  135286
999      Sales   46643

[1000 rows x 2 columns]

In [63]:
data = pd.read_csv("large_employee_data.csv" , usecols=[0,3,4]) 

data

     Employee_ID  Salary  Years_Experience
0              1   77412                 3
1              2   42920                 1
2              3  131194                17
3              4  100315                18
4              5  119561                18
..           ...     ...               ...
995          996   56087                 4
996          997   88868                19
997          998   63225                17
998          999  135286                10
999         1000   46643                14

[1000 rows x 3 columns]

In [64]:
data = pd.read_csv("large_employee_data.csv" , skiprows=[0]) 

data

        1      Sales  38   77412   3  3.2
0       2  Marketing  30   42920   1  4.1
1       3         HR  54  131194  17  1.8
2       4      Sales  41  100315  18  3.9
3       5      Sales  34  119561  18  3.5
4       6  Marketing  49   48946  16  4.6
..    ...        ...  ..     ...  ..  ...
994   996         HR  39   56087   4  1.8
995   997         HR  27   88868  19  1.0
996   998  Marketing  39   63225  17  1.2
997   999  Marketing  40  135286  10  4.6
998  1000      Sales  43   46643  14  3.6

[999 rows x 6 columns]

In [ ]:
data = pd.read_csv("large_employee_data.csv" , index_col=["Department"]) 

data

            Employee_ID  Age  Salary  Years_Experience  Performance_Score
Department
Sales                 1   38   77412                 3                3.2
Marketing             2   30   42920                 1                4.1
HR                    3   54  131194                17                1.8
Sales                 4   41  100315                18                3.9
Sales                 5   34  119561                18                3.5
...                 ...  ...     ...               ...                ...
HR                  996   39   56087                 4                1.8
HR                  997   27   88868                19                1.0
Marketing           998   39   63225                17                1.2
Marketing           999   40  135286                10                4.6
Sales              1000   43   46643                14                3.6

[1000 rows x 5 columns]

In [83]:
data = pd.read_csv("large_employee_data.csv" , index_col= [1]) 

data

            Employee_ID  Age  Salary  Years_Experience  Performance_Score
Department
Sales                 1   38   77412                 3                3.2
Marketing             2   30   42920                 1                4.1
HR                    3   54  131194                17                1.8
Sales                 4   41  100315                18                3.9
Sales                 5   34  119561                18                3.5
...                 ...  ...     ...               ...                ...
HR                  996   39   56087                 4                1.8
HR                  997   27   88868                19                1.0
Marketing           998   39   63225                17                1.2
Marketing           999   40  135286                10                4.6
Sales              1000   43   46643                14                3.6

[1000 rows x 5 columns]

In [67]:
data.index

Index(['Sales', 'Marketing', 'HR', 'Sales', 'Sales', 'Marketing', 'HR', 'HR',
       'Sales', 'Engineering',
       ...
       'Engineering', 'Marketing', 'Engineering', 'Marketing', 'Marketing',
       'HR', 'HR', 'Marketing', 'Marketing', 'Sales'],
      dtype='object', name='Department', length=1000)

In [68]:
data.columns

Index(['Employee_ID', 'Age', 'Salary', 'Years_Experience',
       'Performance_Score'],
      dtype='object')

In [70]:
data.describe()

,Employee_ID,Age,Salary,Years_Experience,Performance_Score
count,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000
mean,500.500000,40.770000,96503.801000,9.469000,3.075100
std,288.819436,10.988533,31808.387724,5.783986,1.132657
min,1.000000,22.000000,40163.000000,0.000000,1.000000
25%,250.750000,31.000000,69266.250000,4.000000,2.175000
50%,500.500000,41.000000,96213.500000,10.000000,3.100000
75%,750.250000,50.000000,125121.500000,14.000000,4.100000
max,1000.000000,59.000000,149847.000000,19.000000,5.000000

In [74]:
data.head()

            Employee_ID  Age  Salary  Years_Experience  Performance_Score
Department
Sales                 1   38   77412                 3                3.2
Marketing             2   30   42920                 1                4.1
HR                    3   54  131194                17                1.8
Sales                 4   41  100315                18                3.9
Sales                 5   34  119561                18                3.5

In [76]:
data[6:11]

             Employee_ID  Age  Salary  Years_Experience  Performance_Score
Department
HR                     7   50  134242                13                4.4
HR                     8   34   85500                18                2.3
Sales                  9   56  144540                12                2.1
Engineering           10   27   56309                11                4.9
Sales                 11   39   95230                 5                3.1

In [77]:
print(type(data))

<class 'pandas.core.frame.DataFrame'>

In [78]:
data.index.array

<NumpyExtensionArray>
[      'Sales',   'Marketing',          'HR',       'Sales',       'Sales',
   'Marketing',          'HR',          'HR',       'Sales', 'Engineering',
 ...
 'Engineering',   'Marketing', 'Engineering',   'Marketing',   'Marketing',
          'HR',          'HR',   'Marketing',   'Marketing',       'Sales']
Length: 1000, dtype: object

In [80]:
data.sort_index(axis=1,ascending=False)

            Years_Experience  Salary  Performance_Score  Employee_ID  Age
Department
Sales                      3   77412                3.2            1   38
Marketing                  1   42920                4.1            2   30
HR                        17  131194                1.8            3   54
Sales                     18  100315                3.9            4   41
Sales                     18  119561                3.5            5   34
...                      ...     ...                ...          ...  ...
HR                         4   56087                1.8          996   39
HR                        19   88868                1.0          997   27
Marketing                 17   63225                1.2          998   39
Marketing                 10  135286                4.6          999   40
Sales                     14   46643                3.6         1000   43

[1000 rows x 5 columns]

In [85]:
data.loc[0,"Department"] = "Salezzzzzzz"

data

,Employee_ID,Age,Salary,Years_Experience,Performance_Score,Department
Department,,,,,,
Sales,1.0,38.0,77412.0,3.0,3.2,NaN
Marketing,2.0,30.0,42920.0,1.0,4.1,NaN
HR,3.0,54.0,131194.0,17.0,1.8,NaN
Sales,4.0,41.0,100315.0,18.0,3.9,NaN
Sales,5.0,34.0,119561.0,18.0,3.5,NaN
...,...,...,...,...,...,...
HR,997.0,27.0,88868.0,19.0,1.0,NaN
Marketing,998.0,39.0,63225.0,17.0,1.2,NaN
Marketing,999.0,40.0,135286.0,10.0,4.6,NaN
Sales,1000.0,43.0,46643.0,14.0,3.6,NaN
0,NaN,NaN,NaN,NaN,NaN,Salezzzzzzz

# dropena & fillna

In [91]:
data.dropna(axis=1)
data.shape
data.head()

,Employee_ID,Age,Salary,Years_Experience,Performance_Score,Department
Department,,,,,,
Sales,1.0,38.0,77412.0,3.0,3.2,NaN
Marketing,2.0,30.0,42920.0,1.0,4.1,NaN
HR,3.0,54.0,131194.0,17.0,1.8,NaN
Sales,4.0,41.0,100315.0,18.0,3.9,NaN
Sales,5.0,34.0,119561.0,18.0,3.5,NaN

# Read JSON

In [ ]:
import pandas as pd

df = pd.read_json('data.json')

print(df.to_string())